# '======================= Переменные ========================'
# # переменные - это ссылка на ячейку памяти, где хранятся какие-то данные, для дальнейшего использования этих данных, при помощи обращения к названию переменной

# #number1 = 123
# #number2 = 35
# #print(number1 + number2)


# '----------------------- Правила наименования переменных -----------------------'
# a = 5 # можно, но назначение не понятно
# # 1number = 123 - нельзя начинать название с чисел
# # my-name = 'Katana' - нельзя использовать в названии символы кроме _ (my_name)
# # hello world - нельзя использовать символы, кроме _

# # print = 12 - нельзя называть переменные ключевыми словами и названиями функций

# #Snake Case - python стиль наименования переменной
# my_name = 'katana'

# #Camel Case - стиль остальных языков программирования
# myName = 'katana'


# '-------------------------- Ввод и вывод данных ----------------------'
# # print - функция вывода данных в терминал
# # input - функция ввода данных с терминала

# #number = input('Введите число: ')
# #print(number)


# name = input('Введите имя:')
# surname = input('Введите фамилию:')
# print(name + ' ' + surname)
# '------------------------ Типы данных ---------------------'
# Типы данных делятся на 2 вида: изменяемые и неизменяемые

# Изменяемые: list(списки), dict(словарь), set(множества)

# Неизменяемые: int(числа), float(вещественные), decimal (вещественные, больше цифр после запятой), str(Строка), tuple(кортежи), bool(булевые), frozenset(не изменяемые сеты), complex, None(пустота)